library(ggplot2)
library(dplyr)

prose_ms <- c(233.4, 265.6, 238.8, 257.5, 210.5, 275.4,
              228.1, 227.3, 207.1, 250.6, 242.5, 252.1,
              247.9, 196.8, 254.9, 252.8, 261.6, 213.2,
              254.5, 206.6, 191.8, 239.7, 250.8)

prose_hs <- c(283.8, 283.8, 288.2, 297.0, 252.7, 302.3,
              274.1, 273.4, 270.7, 280.0, 281.0, 290.6,
              281.9, 243.5, 285.8, 278.1, 295.9, 249.6,
              284.4, 291.5, 243.2, 273.3, 271.1)

prose_univ <- c(314.8, 310.1, 308.3, 312.1, 277.3, 329.1,
                298.3, 288.9, 308.4, 310.4, 312.3, 307.3,
                309.5, 271.4, 302.4, 298.5, 316.9, 271.2,
                315.1, 304.8, 279.2, 302.7, 286.3)

doc_ms <- c(227.1, 276.1, 231.5, 262.6, 201.5, 280.6,
            235.0, 230.6, 199.9, 248.5, 250.9, 244.5,
            247.4, 196.5, 266.3, 266.9, 257.3, 241.1,
            257.0, 206.7, 189.5, 248.2, 214.6)

doc_hs <- c(288.0, 295.4, 280.5, 302.3, 251.5, 308.3,
            283.4, 283.2, 266.1, 281.9, 288.6, 287.3,
            285.5, 239.0, 301.0, 298.2, 297.4, 258.1,
            293.1, 282.9, 246.6, 279.6, 239.9)

doc_univ <- c(318.4, 314.5, 303.5, 311.2, 275.6, 331.2,
              312.5, 300.4, 302.5, 308.0, 313.3, 302.1,
              311.8, 266.2, 320.1, 319.3, 322.3, 280.9,
              326.7, 289.9, 285.4, 306.3, 258.9)

num_ms <- c(233.7, 285.2, 236.8, 263.7, 213.2,
            282.3, 243.8, 245.4, 208.4, 250.0,
            251.7, 246.9, 246.4, 179.2, 280.7,
            272.3, 259.9, 231.5, 262.2, 218.0,
            198.2, 246.0, 252.2)

num_hs <- c(285.6, 300.2, 285.6, 300.2, 263.2,
            307.4, 293.0, 289.7, 270.1, 284.7,
            291.3, 287.8, 285.0, 236.1, 317.2,
            303.6, 291.6, 278.6, 291.6, 289.4,
            258.0, 286.3, 279.8)

num_univ <- c(320.5, 321.0, 310.5, 316.2, 285.8,
              331.7, 311.7, 305.3, 311.8, 311.9,
              324.2, 302.9, 314.6, 272.8, 336.7,
              321.3, 316.2, 308.5, 326.6, 304.3,
              300.3, 313.9, 299.9)

y <- c(prose_ms, prose_hs, prose_univ, doc_ms, doc_hs, doc_univ, num_ms, num_hs, num_univ)

edulevel <- factor(rep(rep(c("중졸이하", "고졸", "대졸이상"), each=23), 3), levels=c("중졸이하", "고졸", "대졸이상"))
type <- factor(rep(c("산문문해","문서문해","수량문해"), each=23*3),
               levels=c("산문문해","문서문해","수량문해"))
iskorea <- rep(c(rep("해외",22), "한국"), 9)

data <- data.frame(y = y, edulevel=edulevel, type=type, iskorea=iskorea)

p <- ggplot(data, aes(x=type, y=y, shape=edulevel, color=iskorea)) + 
  geom_point(aes(size=0.3), position = position_jitterdodge(jitter.width=0.1, dodge.width = 0.5))+
  scale_color_manual(values=c("#000000","#C0C0C0"))+
  scale_shape_manual(values=c(15,16,17)) + xlab("") + ylab("") + ggtitle("학력별 문해력 점수 분포")+
  guides(color = guide_legend(override.aes = list(size = 5), title="국가"),
         size = FALSE,
         shape=guide_legend(override.aes = list(size = 5), title="교육수준"))+
  theme(axis.text=element_text(size=20),
        legend.text=element_text(size=20),
        legend.title=element_text(size=20),
        title = element_text(size=30))

ggsave(filename='literacy.png', plot=p, width=15, height=7)
